In [1]:
import pandas as pd
import numpy as np

In [23]:
data  = [[1,"Applied Mathematics and Cybernetics","700"],[2,"Information Technology","500"],[3,"Chemistry","300"],[4,"Physics","200"]]

In [33]:
DF1= pd.DataFrame(data=data,columns = ["ID","Faculty","STUDENT COUNT"])

In [34]:
DF1

   ID                              Faculty STUDENT COUNT
0   1  Applied Mathematics and Cybernetics           700
1   2               Information Technology           500
2   3                            Chemistry           300
3   4                              Physics           200

In [35]:
data2 = [["65","Computer Science","Applied Mathematics and Cybernetics"],["66","Artificial Intelligence","Information Technology"],["45","Chemisty teacher","Chemistry"],["34a","Physics teacher","Physics"]]

In [36]:
DF2= pd.DataFrame(data=data2,columns = ["Speciality_id","Speciality","Faculty"])

In [37]:
DF2

  Speciality_id               Speciality                              Faculty
0            65         Computer Science  Applied Mathematics and Cybernetics
1            66  Artificial Intelligence               Information Technology
2            45         Chemisty teacher                            Chemistry
3           34a          Physics teacher                              Physics

In [38]:
DF1.merge(DF2,how="left",on=["Faculty"])

,ID,Faculty,STUDENT COUNT,Speciality_id,Speciality
0,1,Applied Mathematics and Cybernetics,700,65,Computer Science
1,2,Information Technology,500,66,Artificial Intelligence
2,3,Chemistry,300,45,Chemisty teacher
3,4,Physics,200,34a,Physics teacher